In [1]:
# !pip install ipython-sql
# !pip install jupyterlab_sql
# !jupyter-lab serverextension enable jupyterlab_sql --py --sys-prefix
# !jupyter lab

In [2]:
%load_ext sql

In [20]:
%sql sqlite:///myfile.db

In [23]:
%%sql
SELECT *  -- Select all
from renting limit 5;        -- From tae renting

   sqlite://
 * sqlite:///myfile.db
Done.

[(1, 41, 8, None, '2018-10-09'),
 (2, 10, 29, 10.0, '2017-03-01'),
 (3, 108, 45, 4.0, '2018-06-08'),
 (4, 39, 66, 8.0, '2018-10-22'),
 (5, 104, 15, 7.0, '2019-03-18')]

In [24]:
%%sql
SELECT movie_id,  -- Select all columns needed to compute the average rating per movie
       rating
FROM renting limit 5;        -- From the renting table

   sqlite://
 * sqlite:///myfile.db
Done.

[(8, None), (29, 10.0), (45, 4.0), (66, 8.0), (15, 7.0)]

In [26]:
%%sql
SELECT movie_id,  -- Select all columns needed to compute the average rating per movie
       rating
FROM renting limit 4;

   sqlite://
 * sqlite:///myfile.db
Done.

[(8, None), (29, 10.0), (45, 4.0), (66, 8.0)]

In [28]:
%%sql
SELECT *
FROM renting WHERE date_renting BETWEEN '2018-04-01' and '2018-08-31' limit 4; -- from beginning April 2018 to end August 2018 ;

   sqlite://
 * sqlite:///myfile.db
Done.

[(3, 108, 45, 4.0, '2018-06-08'),
 (8, 73, 65, 10.0, '2018-06-05'),
 (12, 52, 65, 10.0, '2018-06-29'),
 (14, 8, 29, None, '2018-08-03')]

In [32]:
%%sql
SELECT *
FROM renting
WHERE date_renting BETWEEN '2018-04-01' AND '2018-08-31'
ORDER BY date_renting DESC limit 5; -- Order by recency in decreasing order

   sqlite://
 * sqlite:///myfile.db
Done.

[(76, 112, 10, None, '2018-08-31'),
 (279, 21, 62, None, '2018-08-30'),
 (551, 86, 13, 8.0, '2018-08-29'),
 (39, 25, 52, None, '2018-08-28'),
 (258, 65, 44, 8.0, '2018-08-28')]

In [34]:
%%sql
SELECT *
FROM movies
  WHERE genre <> 'Drama' limit 5; -- All genres except drama

   sqlite://
 * sqlite:///myfile.db
Done.

[(1, "One Night at McCool's", 'Comedy', 93, 2001, 2.09),
 (3, 'What Women Want', 'Comedy', 127, 2001, 2.59),
 (5, 'The Fellowship of the Ring', 'Science Fiction & Fantasy', 178, 2001, 2.59),
 (6, "Harry Potter and the Philosopher's Stone", 'Science Fiction & Fantasy', 152, 2001, 2.69),
 (7, 'The Royal Tenenbaums', 'Comedy', 110, 2002, 1.89)]

In [36]:
%%sql
SELECT *
FROM movies
where title
 in  ( 'Showtime', 'Love Actually' ,'The Fighter'); -- Select all movies with the given titles

   sqlite://
 * sqlite:///myfile.db
Done.

[(11, 'Showtime', 'Comedy', 95, 2002, 1.79),
 (20, 'Love Actually', 'Comedy', 135, 2003, 2.29),
 (53, 'The Fighter', 'Other', 116, 2010, 2.49)]

In [37]:
%%sql
SELECT *
FROM movies
Order by renting_price limit 5; -- Order the movies by increasing renting price

   sqlite://
 * sqlite:///myfile.db
Done.

[(42, 'No Country for Old Men', 'Drama', 122, 2007, 1.49),
 (16, '25th Hour', 'Drama', 135, 2003, 1.59),
 (33, 'V for Vendetta', 'Drama', 132, 2006, 1.59),
 (36, 'World Trade Center', 'Drama', 129, 2006, 1.59),
 (37, 'Candy', 'Drama', 116, 2006, 1.59)]

In [38]:
%%sql
SELECT *
FROM renting
WHERE date_renting between '2018-01-01' AND '2018-12-31' -- Renting in 2018
AND rating is not null limit 5; -- Rating exists

   sqlite://
 * sqlite:///myfile.db
Done.

[(3, 108, 45, 4.0, '2018-06-08'),
 (4, 39, 66, 8.0, '2018-10-22'),
 (6, 50, 71, 7.0, '2018-10-09'),
 (8, 73, 65, 10.0, '2018-06-05'),
 (12, 52, 65, 10.0, '2018-06-29')]

In [54]:
%%sql
SELECT COUNT(*)
FROM customers
WHERE date_of_birth BETWEEN '1980-01-01' AND '1989-12-31';

   sqlite://
 * sqlite:///myfile.db
Done.

[(33,)]

In [55]:
%%sql

SELECT COUNT(*)   -- Count the total number of customers
FROM customers
WHERE country = 'Germany'; -- Select all customers from Germany

   sqlite://
 * sqlite:///myfile.db
Done.

[(0,)]

In [56]:
%%sql
SELECT COUNT(distinct country)   -- Count the number of countries
FROM customers;

   sqlite://
 * sqlite:///myfile.db
Done.

[(11,)]

In [57]:
%%sql
SELECT MIN(rating) AS min_rating, 
       MAX(rating) AS max_rating, 
       AVG(rating) AS avg_rating, 
       COUNT(rating) AS number_ratings
FROM renting
WHERE movie_id = 25;

   sqlite://
 * sqlite:///myfile.db
Done.

[(5.0, 10.0, 7.5, 8)]

In [58]:
%%sql
SELECT * FROM renting WHERE date_renting >= '2019-01-01' limit 5;

   sqlite://
 * sqlite:///myfile.db
Done.

[(5, 104, 15, 7.0, '2019-03-18'),
 (17, 22, 46, 10.0, '2019-02-16'),
 (18, 36, 39, 10.0, '2019-03-20'),
 (27, 7, 36, None, '2019-03-14'),
 (32, 8, 42, 10.0, '2019-02-13')]

In [59]:
%%sql
SELECT 
	COUNT(*), -- Count the total number of rented movies
	AVG(rating) -- Add the average rating
FROM renting
WHERE date_renting >= '2019-01-01' limit 5;

   sqlite://
 * sqlite:///myfile.db
Done.

[(159, 7.946236559139785)]

In [60]:
%%sql
SELECT 
	COUNT(*) as number_renting, -- Give it the column name number_renting
	AVG(rating) as average_rating  -- Give it the column name average_rating
FROM renting
WHERE date_renting >= '2019-01-01';

   sqlite://
 * sqlite:///myfile.db
Done.

[(159, 7.946236559139785)]

In [40]:
%%sql

DROP TABLE IF EXISTS "customers";
CREATE TABLE customers
(
	customer_id integer PRIMARY KEY,
    name character varying,
    country character varying,
    gender character varying,
    date_of_birth date,
    date_account_start date
);

   sqlite://
 * sqlite:///myfile.db
Done.
Done.

[]

In [61]:
%%sql
SELECT 
	COUNT(*) AS number_renting,
	AVG(rating) AS average_rating, 
    count(rating) AS number_ratings -- Add the total number of ratings here.
FROM renting
WHERE date_renting >= '2019-01-01';

   sqlite://
 * sqlite:///myfile.db
Done.

[(159, 7.946236559139785, 93)]

In [5]:
%%sql
DROP TABLE IF EXISTS "movies";
CREATE TABLE movies
(
    movie_id INT PRIMARY KEY,
    title TEXT,
    genre TEXT,
    runtime INT,
    year_of_release INT,
    renting_price numeric
);

 * sqlite://
Done.
Done.

[]

In [6]:
%%sql
COPY movies
	FROM PROGRAM 'curl "https://assets.datacamp.com/production/repositories/4068/datasets/3eebf2a145b76fee37357bcd55ac54577c03c805/movies_181127_2.csv"' (DELIMITER ',', FORMAT CSV, HEADER);

 * sqlite://
(sqlite3.OperationalError) near "COPY": syntax error
[SQL: COPY movies
	FROM PROGRAM 'curl "https://assets.datacamp.com/production/repositories/4068/datasets/3eebf2a145b76fee37357bcd55ac54577c03c805/movies_181127_2.csv"' (DELIMITER ',', FORMAT CSV, HEADER);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [8]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

# Create a DataFrame from the results of the SQL query
movies_df = %sql SELECT * FROM movies
movies_df = movies_df.DataFrame()   
movies_df.head()

 * sqlite://
Done.

Empty DataFrame
Columns: []
Index: []

In [14]:
movies_df = pd.read_csv( "https://assets.datacamp.com/production/repositories/4068/datasets/3eebf2a145b76fee37357bcd55ac54577c03c805/movies_181127_2.csv")
movies_df.shape
import sqlite3
conn = sqlite3.connect("myfile.db")
movies_df.to_sql("movies", conn, if_exists="replace",index=False)

71

In [15]:
url = "https://assets.datacamp.com/production/repositories/4068/datasets/c67f20fa317e8229eed7586cda8bfce5fc177444/actors_181127_2.csv"
actors_df = pd.read_csv(url)
actors_df.shape
actors_df.to_sql("actors", conn, if_exists="replace",index=False)

145

In [16]:
url = "https://assets.datacamp.com/production/repositories/4068/datasets/6efc08575effcc9327c82fea18aaf22dfd61cc27/actsin_181127_2.csv"
actsin_df = pd.read_csv(url)
actsin_df.shape
actsin_df.to_sql("actsin", conn, if_exists="replace",index=False)

213

In [51]:
url ="https://assets.datacamp.com/production/repositories/4068/datasets/4b1767d8e638ab26e62d98517fef297d72260992/customers_181127_2.csv"
customers_df = pd.read_csv(url)
#  add columns name to the dataframe

# DROP TABLE IF EXISTS "customers";
# CREATE TABLE customers
# (
# 	customer_id integer PRIMARY KEY,
#     name character varying,
#     country character varying,
#     gender character varying,
#     date_of_birth date,
#     date_account_start date
# );
# 
# customer_id	Austria	male	1980-07-30	2018-09-02
customers_df = customers_df.rename(columns={'Robert Bohm':'name', '1':'customer_id','Austria': 'country', 'male':'gender','1980-07-30':'date_of_birth'	,'2018-09-02':'date_account_start'})
customers_df.head()
customers_df.to_sql("customers", conn, if_exists="append",index=False)

122

In [18]:
url = "https://assets.datacamp.com/production/repositories/4068/datasets/d36ed7719976092a9b3387c8a2ac077914c9e1d2/renting_181127_2.csv"
renting_df = pd.read_csv(url)
renting_df.shape
renting_df.to_sql("renting", conn, if_exists="replace",index=False)

578